Чистая/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Чистая/src/Documents/ПоступлениеТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Цена * ИзмененнаяСтрока.Количество;
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Цена * ИзмененнаяСтрока.Количество;
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры 


&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииКоличества(ТекущиеДанныеТаблицы);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииЦены(ТекущиеДанныеТаблицы);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииСуммы(ТекущиеДанныеТаблицы);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииСтавкиНДС(ТекущиеДанныеТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиПриИзменении(Элемент)
	Объект.Сумма = Объект.ТоварыИУслуги.Итог("Сумма") + Объект.ТоварыИУслуги.Итог("СуммаНДС"); 
КонецПроцедуры
